Laur59/uKOS-X-IWYU/Ports/EquatesModels/SOCs/STM32U5G9/Includes/Registers/stm32U5Gx_dbgmcu.h
/*
SPDX-License-Identifier: MIT
SPDX-FileCopyrightText: 2025-2026 Edo. Franzi
*/

/*
; stm32U5Gx_dbgmcu.
; =================

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     stm32U5Gx_dbgmcu equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// DBGMCU address definitions
// --------------------------

typedef struct {
    volatile    uint32_t    IDCODE;
    volatile    uint32_t    CR;
    volatile    uint32_t    APB1LFZR;
    volatile    uint32_t    APB1HFZR;
    volatile    uint32_t    APB2FZR;
    volatile    uint32_t    APB3FZR;
    volatile    uint32_t    RESERVED0[2];
    volatile    uint32_t    AHB1FZR;
    volatile    uint32_t    RESERVED1;
    volatile    uint32_t    AHB3FZR;
    volatile    uint32_t    RESERVED2[52];
    volatile    uint32_t    SR;
    volatile    uint32_t    DBG_AUTH_HOST;
    volatile    uint32_t    DBG_AUTH_DEVICE;
    volatile    uint32_t    RESERVED3[946];
    volatile    uint32_t    PIDR4;
    volatile    uint32_t    RESERVED4[3];
    volatile    uint32_t    PIDR0;
    volatile    uint32_t    PIDR1;
    volatile    uint32_t    PIDR2;
    volatile    uint32_t    PIDR3;
    volatile    uint32_t    CIDR0;
    volatile    uint32_t    CIDR1;
    volatile    uint32_t    CIDR2;
    volatile    uint32_t    CIDR3;
} DBGMCU_TypeDef;

#ifdef __cplusplus
#define DBGMCU_NS   reinterpret_cast<DBGMCU_TypeDef *>(0xE0044000U)

#else
#define DBGMCU_NS   ((DBGMCU_TypeDef *)0xE0044000U)
#endif

// IDCODE Configuration

#define DBGMCU_IDCODE_REV_ID                (0xFFFFU<<16)
#define DBGMCU_IDCODE_REV_ID_0              (0x1U<<16)
#define DBGMCU_IDCODE_DEV_ID                (0xFFFU<<0)
#define DBGMCU_IDCODE_DEV_ID_0              (0x1U<<0)

// CR Configuration

#define DBGMCU_CR_TRACE_MODE                (0x3U<<6)
#define DBGMCU_CR_TRACE_MODE_0              (0x1U<<6)
#define DBGMCU_CR_TRACE_EN                  (0x1U<<5)
#define DBGMCU_CR_TRACE_IOEN                (0x1U<<4)
#define DBGMCU_CR_DBG_STANDBY               (0x1U<<2)
#define DBGMCU_CR_DBG_STOP                  (0x1U<<1)

// APB1LFZR Configuration

#define DBGMCU_APB1LFZR_DBG_I2C2_STOP       (0x1U<<22)
#define DBGMCU_APB1LFZR_DBG_I2C1_STOP       (0x1U<<21)
#define DBGMCU_APB1LFZR_DBG_IWDG_STOP       (0x1U<<12)
#define DBGMCU_APB1LFZR_DBG_WWDG_STOP       (0x1U<<11)
#define DBGMCU_APB1LFZR_DBG_TIM7_STOP       (0x1U<<5)
#define DBGMCU_APB1LFZR_DBG_TIM6_STOP       (0x1U<<4)
#define DBGMCU_APB1LFZR_DBG_TIM5_STOP       (0x1U<<3)
#define DBGMCU_APB1LFZR_DBG_TIM4_STOP       (0x1U<<2)
#define DBGMCU_APB1LFZR_DBG_TIM3_STOP       (0x1U<<1)
#define DBGMCU_APB1LFZR_DBG_TIM2_STOP       (0x1U<<0)

// APB1HFZR Configuration

#define DBGMCU_APB1HFZR_DBG_LPTIM2_STOP     (0x1U<<5)
#define DBGMCU_APB1HFZR_DBG_I2C4_STOP       (0x1U<<1)

// APB2FZR Configuration

#define DBGMCU_APB2FZR_DBG_TIM17_STOP       (0x1U<<18)
#define DBGMCU_APB2FZR_DBG_TIM16_STOP       (0x1U<<17)
#define DBGMCU_APB2FZR_DBG_TIM15_STOP       (0x1U<<16)
#define DBGMCU_APB2FZR_DBG_TIM8_STOP        (0x1U<<13)
#define DBGMCU_APB2FZR_DBG_TIM1_STOP        (0x1U<<11)

// APB3FZR Configuration

#define DBGMCU_APB3FZR_DBG_RTC_STOP         (0x1U<<30)
#define DBGMCU_APB3FZR_DBG_LPTIM4_STOP      (0x1U<<19)
#define DBGMCU_APB3FZR_DBG_LPTIM3_STOP      (0x1U<<18)
#define DBGMCU_APB3FZR_DBG_LPTIM1_STOP      (0x1U<<17)
#define DBGMCU_APB3FZR_DBG_I2C3_STOP        (0x1U<<10)

// AHB1FZR Configuration

#define DBGMCU_AHB1FZR_DBG_GPDMA15_STOP     (0x1U<<15)
#define DBGMCU_AHB1FZR_DBG_GPDMA14_STOP     (0x1U<<14)
#define DBGMCU_AHB1FZR_DBG_GPDMA13_STOP     (0x1U<<13)
#define DBGMCU_AHB1FZR_DBG_GPDMA12_STOP     (0x1U<<12)
#define DBGMCU_AHB1FZR_DBG_GPDMA11_STOP     (0x1U<<11)
#define DBGMCU_AHB1FZR_DBG_GPDMA10_STOP     (0x1U<<10)
#define DBGMCU_AHB1FZR_DBG_GPDMA9_STOP      (0x1U<<9)
#define DBGMCU_AHB1FZR_DBG_GPDMA8_STOP      (0x1U<<8)
#define DBGMCU_AHB1FZR_DBG_GPDMA7_STOP      (0x1U<<7)
#define DBGMCU_AHB1FZR_DBG_GPDMA6_STOP      (0x1U<<6)
#define DBGMCU_AHB1FZR_DBG_GPDMA5_STOP      (0x1U<<5)
#define DBGMCU_AHB1FZR_DBG_GPDMA4_STOP      (0x1U<<4)
#define DBGMCU_AHB1FZR_DBG_GPDMA3_STOP      (0x1U<<3)
#define DBGMCU_AHB1FZR_DBG_GPDMA2_STOP      (0x1U<<2)
#define DBGMCU_AHB1FZR_DBG_GPDMA1_STOP      (0x1U<<1)
#define DBGMCU_AHB1FZR_DBG_GPDMA0_STOP      (0x1U<<0)

// AHB3FZR Configuration

#define DBGMCU_AHB3FZR_DBG_LPDMA3_STOP      (0x1U<<3)
#define DBGMCU_AHB3FZR_DBG_LPDMA2_STOP      (0x1U<<2)
#define DBGMCU_AHB3FZR_DBG_LPDMA1_STOP      (0x1U<<1)
#define DBGMCU_AHB3FZR_DBG_LPDMA0_STOP      (0x1U<<0)

// SR Configuration

#define DBGMCU_SR_AP_LOCKED                 (0xFFU<<8)
#define DBGMCU_SR_AP_LOCKED_0               (0x1U<<8)
#define DBGMCU_SR_AP_PRESENT                (0xFFU<<0)
#define DBGMCU_SR_AP_PRESENT_0              (0x1U<<0)

// DBG_AUTH_HOST Configuration

#define DBGMCU_DBG_AUTH_HOST_AUTH_KEY       (0xFFFFFFFFU<<0)
#define DBGMCU_DBG_AUTH_HOST_AUTH_KEY_0     (0x1U<<0)

// DBG_AUTH_DEVICE Configuration

#define DBGMCU_DBG_AUTH_DEVICE_AUTH_ID      (0xFFFFU<<0)
#define DBGMCU_DBG_AUTH_DEVICE_AUTH_ID_0    (0x1U<<0)

// PIDR4 Configuration

#define DBGMCU_PIDR4_KCOUNT_4               (0xFU<<4)
#define DBGMCU_PIDR4_KCOUNT_4_0             (0x1U<<4)
#define DBGMCU_PIDR4_JEP106CON              (0xFU<<0)
#define DBGMCU_PIDR4_JEP106CON_0            (0x1U<<0)

// PIDR0 Configuration

#define DBGMCU_PIDR0_PARTNUM                (0xFFU<<0)
#define DBGMCU_PIDR0_PARTNUM_0              (0x1U<<0)

// PIDR1 Configuration

#define DBGMCU_PIDR1_JEP106ID               (0xFU<<4)
#define DBGMCU_PIDR1_JEP106ID_0             (0x1U<<4)
#define DBGMCU_PIDR1_PARTNUM                (0xFU<<0)
#define DBGMCU_PIDR1_PARTNUM_0              (0x1U<<0)

// PIDR2 Configuration

#define DBGMCU_PIDR2_REVISION               (0xFU<<4)
#define DBGMCU_PIDR2_REVISION_0             (0x1U<<4)
#define DBGMCU_PIDR2_JEDEC                  (0x1U<<3)
#define DBGMCU_PIDR2_JEP106ID               (0x7U<<0)
#define DBGMCU_PIDR2_JEP106ID_0             (0x1U<<0)

// PIDR3 Configuration

#define DBGMCU_PIDR3_REVAND                 (0xFU<<4)
#define DBGMCU_PIDR3_REVAND_0               (0x1U<<4)
#define DBGMCU_PIDR3_CMOD                   (0xFU<<0)
#define DBGMCU_PIDR3_CMOD_0                 (0x1U<<0)

// CIDR0 Configuration

#define DBGMCU_CIDR0_PREAMBLE               (0xFFU<<0)
#define DBGMCU_CIDR0_PREAMBLE_0             (0x1U<<0)

// CIDR1 Configuration

#define DBGMCU_CIDR1_CLASS                  (0xFU<<4)
#define DBGMCU_CIDR1_CLASS_0                (0x1U<<4)
#define DBGMCU_CIDR1_PREAMBLE               (0xFU<<0)
#define DBGMCU_CIDR1_PREAMBLE_0             (0x1U<<0)

// CIDR2 Configuration

#define DBGMCU_CIDR2_PREAMBLE               (0xFFU<<0)
#define DBGMCU_CIDR2_PREAMBLE_0             (0x1U<<0)

// CIDR3 Configuration

#define DBGMCU_CIDR3_PREAMBLE               (0xFFU<<0)
#define DBGMCU_CIDR3_PREAMBLE_0             (0x1U<<0)
